In [0]:
import pandas as pd

In [0]:
data = pd.read_csv('sample_data/titanic.csv', index_col = 'PassengerId')

In [5]:
data['Sex'].value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [6]:
data[data['Survived'] == 1]['Survived'].count()

342

In [7]:
round(data[data['Survived'] == 1]['Survived'].count()/data['Survived'].count()*100,2)

38.38

In [8]:
round(data[data['Pclass'] == 1]['Pclass'].count()/data['Pclass'].count()*100,2)

24.24

In [9]:
round(data['Age'].mean(), 2)

29.7

In [10]:
round(data['Age'].median(), 2)

28.0

In [11]:
round(data['SibSp'].corr(data['Parch']),2)

0.41

In [12]:
data[data['Sex'] == 'female']

             Survived  Pclass  ... Cabin Embarked
PassengerId                    ...
2                   1       1  ...   C85        C
3                   1       3  ...   NaN        S
4                   1       1  ...  C123        S
9                   1       3  ...   NaN        S
10                  1       2  ...   NaN        C
...               ...     ...  ...   ...      ...
881                 1       2  ...   NaN        S
883                 0       3  ...   NaN        S
886                 0       3  ...   NaN        Q
888                 1       1  ...   B42        S
889                 0       3  ...   NaN        S

[314 rows x 11 columns]

In [13]:
text = data[data['Sex'] == 'female']['Name']
print(text)

PassengerId
2      Cumings, Mrs. John Bradley (Florence Briggs Th...
3                                 Heikkinen, Miss. Laina
4           Futrelle, Mrs. Jacques Heath (Lily May Peel)
9      Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)
10                   Nasser, Mrs. Nicholas (Adele Achem)
                             ...
881         Shelley, Mrs. William (Imanita Parrish Hall)
883                         Dahlberg, Miss. Gerda Ulrika
886                 Rice, Mrs. William (Margaret Norton)
888                         Graham, Miss. Margaret Edith
889             Johnston, Miss. Catherine Helen "Carrie"
Name: Name, Length: 314, dtype: object

In [14]:
def rule(x):
  if x.split(',')[1].split('.')[0].strip() == 'Miss':
    return x.split(',')[1].split('.')[1].strip()
  elif x.split(',')[1].split('.')[0].strip() == 'Mrs':
    return  x.split(',')[1].split('.')[1].split('(')[-1].strip(')').strip() 

first_name = text.apply(lambda x: rule(x))
print(first_name)

PassengerId
2         Florence Briggs Thayer
3                          Laina
4                  Lily May Peel
9      Elisabeth Vilhelmina Berg
10                   Adele Achem
                 ...
881         Imanita Parrish Hall
883                 Gerda Ulrika
886              Margaret Norton
888               Margaret Edith
889     Catherine Helen "Carrie"
Name: Name, Length: 314, dtype: object

In [15]:
first_name.value_counts()

Mary                   7
Anna                   4
Bertha                 4
Anna Sofia             3
Katherine "Katie"      2
                      ..
Ingeborg Constanzia    1
Adele Achem            1
Ada Mary Worth         1
Marion Louise          1
Augusta Tyler          1
Name: Name, Length: 285, dtype: int64

import re
text_list = text.split(',')
text_list.list()